lab11_php_ci/ci4/app/Controllers/Artikel.php

SELECT *
FROM `kategori`
---
        }

        $kategoriModel = new \App\Models\KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();

SELECT *
FROM `kategori`
---

        return view('artikel/form_add', [
            'title'    => 'Tambah Artikel',
            'kategori' => $kategoriModel->findAll()

SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '1'
---
    public function edit($id)
    {
        helper(['form', 'text']);

        $model = new ArtikelModel();

        $kategoriModel = new KategoriModel();

        $artikel = $model->find($id);

SELECT *
FROM `kategori`
---
        return view('artikel/form_edit', [
            'title'    => 'Edit Artikel',
            'artikel'  => $artikel,
            'kategori' => $kategoriModel->findAll()