lab11_php_ci/ci4/app/Controllers/Post.php

SELECT *
FROM `artikel`
ORDER BY `id` DESC
---
    public function index()
    {
        $model = new ArtikelModel();

        $data['artikel'] = $model
            ->orderBy('id', 'DESC')
            ->findAll();